## Pandas Project 1

###   Summary:

1: We use some Attribute: like shape,index and columns

2: Built in Functions


head(),tail(), isnull(), isnull().sum(), info(), describe(), unique(), nunique(), value_counts(),
between(), isin(), map(),sort_values(by = ), apply(), drop(), max(), min(), mean()

#  Confusing Topics:: axis for rows and cols

# WE can also pass the axis = o for cols and axis = 1 for cols to check
data.isnull().sum(axis = 1)       # for rows. will check the row wise data
data.isnull().sum(axis = 0)       # by default and check cols wise data

delete a col  or cols.  Remember:: In case of finding the null values we use axis = 0 for col
# and axis = 1 for rows. But in case of droppoing we use axis = 1 for col and axis = 0 for rows

# 17 Need the Name and Marks of Female Students Only 
# If one col is needed then after masking give the name of that col in square baracket
# But for more cols we have to use 2d list. otherwise it will throw an error
data[data['Gender'] == 'Female'][['Name','Marks']]

In [1]:
import pandas as pd

In [49]:
# In the dict the Key is consider the column name and the value are number of elements/Rows in that
# particular Column once converted to DataFrame

mydict = {'Name':['Ozair','Alia','Bilal','Ahmad','Phebe Bufae','Monica Geller','Rachel Green'],
          'Marks':[90,89, 79,60,50,80,99],
          'Gender':['Male','Female','Male','Male','Female','Female','Female']
         }

data = pd.DataFrame(mydict)
data

            Name  Marks  Gender
0          Ozair     90    Male
1           Alia     89  Female
2          Bilal     79    Male
3          Ahmad     60    Male
4    Phebe Bufae     50  Female
5  Monica Geller     80  Female
6   Rachel Green     99  Female

In [3]:
# 1: Check the first 3 rows

In [4]:
data.head(3)

    Name  Marks  Gender
0  Ozair     90    Male
1   Alia     89  Female
2  Bilal     79    Male

In [5]:
# 2.    To check the last 3
data.tail(3)

            Name  Marks  Gender
4    Phebe Bufae     50  Female
5  Monica Geller     80  Female
6   Rachel Green     99  Female

In [50]:
# 3 Find Shape:Remember the shape, columns, index are the attribute and the methods so we don't use parenthesis with them
data.shape

(7, 3)

In [7]:
# To seperate the rows and cols from the above 

rows = data.shape[0]
cols = data.shape[1]
print(f"row are {rows} and cols are {cols}")

row are 7 and cols are 3

In [8]:
# 4: To get the info about the data: It tells about rows, cols , datatype and null values if any in the data
# and memory Requirement of the data
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

In [52]:
# 5. To check the null values in the data 
data.isnull()  # but what if we have huge amount of data, we won't be able to see throught the data. 
# so we use the sum() method which will tells more about the null values
data.isnull().sum()

# All the zeros indicate we don't have null values in the data

# WE can also pass the axis = o for cols and axis = 1 for cols to check
data.isnull().sum(axis = 1)       # for rows. will check the row wise data
data.isnull().sum(axis = 0)       # by default and check cols wise data

Name      0
Marks     0
Gender    0
dtype: int64

In [10]:
# 6.     Get the Stastical info for numeric data only 
# But if we want to show for all we need to pass the 'include = True' to the function 
data.describe()

           Marks
count   7.000000
mean   78.142857
std    17.410998
min    50.000000
25%    69.500000
50%    80.000000
75%    89.500000
max    99.000000

In [12]:
# 7 Find the unique values from Gender cols

data['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [15]:
# 8 Find the number of Male and Female
print(data['Gender'].nunique())

2

In [16]:
# 9 Count of unique values in the gender colos
data['Gender'].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

In [20]:
# Marks b/w 90 and 100 both are inclusive. WE need to find the nums of students

len(data[(data['Marks'] >= 90) & (data['Marks'] <=100)])

2

In [22]:
# We can also use the between function 

sum(data['Marks'].between(90,100))

2

In [23]:
# 11 Find tha Avg Marks
data['Marks'].mean()

np.float64(78.14285714285714)

In [33]:
# 12 Use apply method to add a new col to data. that new col should have half marks
# We can either use a function or lambda function to do this
# Main Point is that with apply function we have to pass a Function to it. It could  be function name or lambda

    # Method 1
def Marks(marks):
    return marks//2

In [70]:
data['Half Marks'] = data['Marks'].apply(Marks)
data

            Name  Marks  Gender  Half Lambda Marks  Half Marks
0          Ozair     90    Male               45.0          45
1           Alia     89  Female               44.5          44
2          Bilal     79    Male               39.5          39
3          Ahmad     60    Male               30.0          30
4    Phebe Bufae     50  Female               25.0          25
5  Monica Geller     80  Female               40.0          40
6   Rachel Green     99  Female               49.5          49

In [71]:
# Method 2 we can use lambda function to do this task:

data['Half Lambda Marks'] = data['Marks'].apply(lambda marks:marks/2)
data

            Name  Marks  Gender  Half Lambda Marks  Half Marks
0          Ozair     90    Male               45.0          45
1           Alia     89  Female               44.5          44
2          Bilal     79    Male               39.5          39
3          Ahmad     60    Male               30.0          30
4    Phebe Bufae     50  Female               25.0          25
5  Monica Geller     80  Female               40.0          40
6   Rachel Green     99  Female               49.5          49

In [72]:
# 13    Map function. This function is using for mapping purpose like map one value to another
# map funciton takes a dict,in which one item is replace by another. We can also use replace function that 
# also takes a dict. and we can use apply function to do the same 

data['NewGender'] = data['Gender'].map({'Male':1,'Female':0})
data

            Name  Marks  Gender  Half Lambda Marks  Half Marks  NewGender
0          Ozair     90    Male               45.0          45          1
1           Alia     89  Female               44.5          44          0
2          Bilal     79    Male               39.5          39          1
3          Ahmad     60    Male               30.0          30          1
4    Phebe Bufae     50  Female               25.0          25          0
5  Monica Geller     80  Female               40.0          40          0
6   Rachel Green     99  Female               49.5          49          0

In [73]:
# Methode 2 to do the same
# Opt-in to the future behavior
pd.set_option('future.no_silent_downcasting', True)
data['Gender'].replace({'Male':1,'Female':0})

0    1
1    0
2    1
3    1
4    0
5    0
6    0
Name: Gender, dtype: object

In [74]:
# Method 3: Using apply with lambda funciton 

data['Gender'].apply(lambda gen:1 if gen == 'Male' else 0)

0    1
1    0
2    1
3    1
4    0
5    0
6    0
Name: Gender, dtype: int64

In [75]:
# 14:     delete a col  or cols.  Remember:: In case of finding the null values we use axis = 0 for col
# and axis = 1 for rows. But in case of droppoing we use axis = 1 for col and axis = 0 for rows

data.drop('NewGender',axis = 1,inplace = True)
data

            Name  Marks  Gender  Half Lambda Marks  Half Marks
0          Ozair     90    Male               45.0          45
1           Alia     89  Female               44.5          44
2          Bilal     79    Male               39.5          39
3          Ahmad     60    Male               30.0          30
4    Phebe Bufae     50  Female               25.0          25
5  Monica Geller     80  Female               40.0          40
6   Rachel Green     99  Female               49.5          49

In [78]:
# To Delete multiple cols we can use python list to do this task
data.drop(['Half Lambda Marks','Half Marks'],axis = 1, inplace = True)
data

            Name  Marks  Gender
0          Ozair     90    Male
1           Alia     89  Female
2          Bilal     79    Male
3          Ahmad     60    Male
4    Phebe Bufae     50  Female
5  Monica Geller     80  Female
6   Rachel Green     99  Female

In [84]:
# 15: print the names of the cols, len of cols and index of rows
# Remember the stop in the indexes are not included
print(data.columns)
print(data.index)
print("the len is ",(len(data.columns)))

Index(['Name', 'Marks', 'Gender'], dtype='object')
RangeIndex(start=0, stop=7, step=1)
the len is  3

In [87]:
# 16      sort the values by marks cols from highest to lowest. The default is Asc

data.sort_values(by ='Marks',ascending = False)

            Name  Marks  Gender
6   Rachel Green     99  Female
0          Ozair     90    Male
1           Alia     89  Female
5  Monica Geller     80  Female
2          Bilal     79    Male
3          Ahmad     60    Male
4    Phebe Bufae     50  Female

In [95]:
# 17 Need the Name and Marks of Female Students Only 
# If one col is needed then after masking give the name of that col in square baracket
# But for more cols we have to use 2d list. otherwise it will throw an error
data[data['Gender'] == 'Female'][['Name','Marks']]

            Name  Marks
1           Alia     89
4    Phebe Bufae     50
5  Monica Geller     80
6   Rachel Green     99

In [100]:
# for the same purpose we can also use . isin() funciton that takes an argumnt that we want to find in the col
# name should be passed in square baracket
data[data['Gender'].isin(['Female'])][['Name','Marks']]

            Name  Marks
1           Alia     89
4    Phebe Bufae     50
5  Monica Geller     80
6   Rachel Green     99

In [101]:
# we can do the same for male

In [103]:
data['Gender'] == 'Male' # this is mask. Pass it to the dataframe

0     True
1    False
2     True
3     True
4    False
5    False
6    False
Name: Gender, dtype: bool

In [105]:
data[data['Gender'] == 'Male' ][['Name','Marks']]

    Name  Marks
0  Ozair     90
2  Bilal     79
3  Ahmad     60